oliver-joos/micropython/ports/stm32/eth.c
    // Allocate TX buffer slots.
    unsigned int idx = 0;
    for (struct pbuf *pb = p; pb != NULL; pb = pb->next) {
        int ret = eth_tx_buf_get_ref(pb->len, pb->payload, idx++);
        if (ret != 0) {
            if (made_pbuf_copy) {
                pbuf_free(p);
            }
            return ERR_BUF;
        }
    }

    // Take references to pbufs
    idx = 0;
    for (struct pbuf *pb = p; pb != NULL; pb = pb->next) {
        unsigned int tx_idx = (eth_dma_tx_descr_idx + idx) % TX_BUF_NUM;
        if (eth_dma_pbuf[tx_idx] != NULL) {
            pbuf_free(eth_dma_pbuf[tx_idx]);
        }
        if (!made_pbuf_copy) {
            pbuf_ref(pb);
        }
        eth_dma_pbuf[tx_idx] = pb;
        ++idx;
    }

    // Start the transmission.
    int ret = eth_tx_buf_send(num_segments);

    #else

    // Allocate TX slot, copy the pbuf, and start the transmission.
    uint8_t *buf;
    int ret = eth_tx_buf_get(p->tot_len, &buf);
    if (ret == 0) {
        pbuf_copy_partial(p, buf, p->tot_len, 0);
        ret = eth_tx_buf_send(1);
    }

    #endif

    return ret ? ERR_BUF : ERR_OK;
}

static err_t eth_netif_init(struct netif *netif) {
    netif->linkoutput = eth_netif_output;
    netif->output = etharp_output;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP;
    // Checksums only need to be checked on incoming frames, not computed on outgoing frames
    NETIF_SET_CHECKSUM_CTRL(netif,
        NETIF_CHECKSUM_CHECK_IP
        | NETIF_CHECKSUM_CHECK_UDP
        | NETIF_CHECKSUM_CHECK_TCP
        | NETIF_CHECKSUM_CHECK_ICMP
        | NETIF_CHECKSUM_CHECK_ICMP6);
    return ERR_OK;
}

static void eth_lwip_init(eth_t *self) {
    MICROPY_PY_LWIP_ENTER
    // Initialize netif structure
    struct netif *n = &self->netif;
    n->name[0] = 'e';
    n->name[1] = '0';
    n->state = self;

    // Set default IP configuration (0.0.0.0 = use DHCP)
    ip_addr_t ipconfig[4];
    IP_ADDR4(&ipconfig[0], 0, 0, 0, 0);        // IP: 0.0.0.0 (DHCP)
    IP_ADDR4(&ipconfig[1], 255, 255, 255, 0);  // Netmask
    IP_ADDR4(&ipconfig[2], 192, 168, 0, 1);    // Gateway
    IP_ADDR4(&ipconfig[3], 8, 8, 8, 8);        // DNS

    netif_add(n, ip_2_ip4(&ipconfig[0]), ip_2_ip4(&ipconfig[1]), ip_2_ip4(&ipconfig[2]), self, eth_netif_init, ethernet_input);
    netif_set_hostname(n, mod_network_hostname_data);

    ip_addr_t dns_addr;
    IP_ADDR4(&dns_addr, 8, 8, 8, 8);
    dns_setserver(0, &dns_addr);

    // Initialize DHCP structure
    dhcp_set_struct(n, &self->dhcp_struct);

    #if LWIP_IPV6
    netif_create_ip6_linklocal_address(n, 1);
    #endif
    MICROPY_PY_LWIP_EXIT
}


void eth_phy_link_status_poll() {
    eth_t *self = &eth_instance;
    if (!self->enabled) {
        return;
    }
    // Poll PHY link status and handle state changes
    uint16_t bsr = eth_phy_read(self->phy_addr, PHY_BSR);
    bool current_link_status = (bsr & PHY_BSR_LINK_STATUS) != 0;

    // Check if link status changed
    if (current_link_status != self->last_link_status) {
        self->last_link_status = current_link_status;

        // Update LWIP netif link status to reflect physical cable connection
        struct netif *netif = &self->netif;
        MICROPY_PY_LWIP_ENTER
        if (current_link_status) {
            // Cable is physically connected
            netif_set_link_up(netif);

            // Start or restart DHCP if interface is up
            if (netif_is_up(netif)) {
                if (netif_dhcp_data(netif)) {
                    // DHCP already running, renew lease
                    dhcp_renew(netif);
                } else if (ip4_addr_isany_val(*netif_ip4_addr(netif))) {
                    // No static IP and no DHCP running, start DHCP
                    dhcp_start(netif);
                }
            }
        } else {
            // Cable is physically disconnected
            netif_set_link_down(netif);
        }
        MICROPY_PY_LWIP_EXIT
    }
}

static void eth_process_frame(eth_t *self, size_t len, const uint8_t *buf) {
    eth_trace(self, len, buf, NETUTILS_TRACE_NEWLINE);

    struct netif *netif = &self->netif;
    if (netif->flags & NETIF_FLAG_LINK_UP) {
        struct pbuf *p = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);
        if (p != NULL) {
            pbuf_take(p, buf, len);
            if (netif->input(p, netif) != ERR_OK) {
                pbuf_free(p);
            }
        }
    }
}

struct netif *eth_netif(eth_t *self) {
    return &self->netif;
}

int eth_link_status(eth_t *self) {
    // Do a quick poll to ensure link status is current
    eth_phy_link_status_poll();

    struct netif *netif = &self->netif;
    if ((netif->flags & (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP))
        == (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP)) {
        if (!ip4_addr_isany_val(*netif_ip4_addr(netif))) {
            return 3; // link up with IP
        } else {
            return 2; // link up, no IP
        }
    } else {
        // Check physical link status - use direct PHY read if not enabled yet
        bool physical_link_up;
        if (self->enabled) {
            physical_link_up = self->last_link_status;
        } else {
            // Direct PHY read when interface not enabled
            uint16_t bsr = eth_phy_read(self->phy_addr, PHY_BSR);
            physical_link_up = (bsr & PHY_BSR_LINK_STATUS) != 0;
        }

        if (physical_link_up) {
            return 1; // physical link up but interface down
        } else {
            return 0; // link down
        }
    }
}

bool eth_is_enabled(eth_t *self) {
    return self->enabled;
}

int eth_start(eth_t *self) {
    // Make sure Eth is Not in low power mode.
    eth_low_power_mode(self, false);

    int ret = eth_mac_init(self);
    if (ret < 0) {
        return ret;
    }

    // Initialize PHY (reset and configure)
    ret = eth_phy_init(self);
    if (ret < 0) {
        eth_mac_deinit(self);
        return ret;
    }

    MICROPY_PY_LWIP_ENTER
    struct netif *n = &self->netif;

    // Enable the interface in LWIP
    netif_set_default(n);
    netif_set_up(n);

