oliver-joos/micropython/ports/stm32/eth.c
    // Do an initial link status poll after PHY has had time to initialize
    eth_phy_link_status_poll();

    // Start DHCP if no static IP has been configured
    if (ip4_addr_isany_val(*netif_ip4_addr(n))) {
        // No static IP configured, start DHCP regardless of link status
        // DHCP will wait for link to come up before sending packets
        dhcp_start(n);
    }

    MICROPY_PY_LWIP_EXIT

    self->enabled = true;
    return 0;
}

int eth_stop(eth_t *self) {
    // Stop DHCP if running
    if (netif_dhcp_data(&self->netif)) {
        dhcp_stop(&self->netif);
    }
    netif_set_down(&self->netif);

    // Shutdown PHY
    eth_low_power_mode(self, true);

    // Clear link status tracking
    self->last_link_status = false;

    eth_mac_deinit(self);
    self->enabled = false;
    return 0;
}

void eth_low_power_mode(eth_t *self, bool enable) {
    (void)self;

    // Enable eth clock
    #if defined(STM32H7)
    __HAL_RCC_ETH1MAC_CLK_ENABLE();
    #elif defined(STM32N6)
    __HAL_RCC_ETH1_CLK_ENABLE();
    #else
    __HAL_RCC_ETH_CLK_ENABLE();
    #endif

    uint16_t bcr = eth_phy_read(self->phy_addr, PHY_BCR);
    if (enable) {
        // Enable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr | PHY_BCR_POWER_DOWN);
        // Disable eth clock.
        #if defined(STM32H7)
        __HAL_RCC_ETH1MAC_CLK_DISABLE();
        #elif defined(STM32N6)
        __HAL_RCC_ETH1_CLK_DISABLE();
        #else
        __HAL_RCC_ETH_CLK_DISABLE();
        #endif
    } else {
        // Disable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr & (~PHY_BCR_POWER_DOWN));
    }
}

static int eth_phy_init(eth_t *self) {
    // Reset the PHY and wait for reset to complete
    eth_phy_write(self->phy_addr, PHY_BCR, PHY_BCR_SOFT_RESET);
    mp_hal_delay_ms(10);

    // Wait for PHY reset to complete (but don't wait for link)
    uint32_t t0 = mp_hal_ticks_ms();
    while (eth_phy_read(self->phy_addr, PHY_BCR) & PHY_BCR_SOFT_RESET) {
        if (mp_hal_ticks_ms() - t0 > 1000) {  // 1 second timeout for reset
            return -MP_ETIMEDOUT;
        }
        mp_hal_delay_ms(2);
    }

    // Initialize link status tracking (current state, whatever it is)
    self->last_link_status = false;
    eth_phy_link_status_poll();

    return 0;
}

#endif // defined(MICROPY_HW_ETH_MDC)
